t/methods/GetParameterValues.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
               xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
  <soap:Header>
    <cwmp:ID soap:mustUnderstand="1">42</cwmp:ID>
    <cwmp:NoMoreRequests>0</cwmp:NoMoreRequests>
  </soap:Header>
  <soap:Body>
    <cwmp:GetParameterValues>
      <ParameterNames encodingStyle:arrayType="xsd:string[2]">
        <string>InternetGatewayDevice.DeviceInfo.SerialNumber</string>
        <string>InternetGatewayDevice.DeviceInfo.VendorConfigFile.</string>
      </ParameterNames>
    </cwmp:GetParameterValues>
  </soap:Body>
</soap:Envelope>